In [3]:
import pandas as pd

In [5]:
data1 = pd.read_excel(r'C:\Users\user\Documents\DS files\my data1.xlsx')

In [6]:
data1

      Name  Age  Salary
0   Deepak   29   23500
1  puneet    26   22000
2    Akash   24   18000
3    Mohit   25   17500

In [19]:
data2 = pd.read_csv(r"C:\Users\user\Documents\DS files\my data2.csv")

In [21]:
data2

   Roll no      name  batch
0     1001    deepak   1840
1     1002      amit   1255
2     1003     suraj   1544
3     1074  devendra   1840

In [24]:
data3 = pd.read_csv(r'C:\Users\user\Documents\DS files\my data3.tsv', sep = "\t")

In [25]:
data3

      Rollno  Name  Batch
1001  Deepak  1840    NaN
1002   rohit  1544    NaN
1003    Ajay  1547    NaN
1004   Mohit  1364    NaN